Revit 2027 API
BuiltInFailures.GenericMEPFailures.ValidatePHSegmentLengthWarning Property
 The placeholder curve is not long enough to support the required fittings for placeholder convert
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ValidatePHSegmentLengthWarning { get; }
Public Shared ReadOnly Property ValidatePHSegmentLengthWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ValidatePHSegmentLengthWarning {
	FailureDefinitionId^ get ();
}
static member ValidatePHSegmentLengthWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace